Autodesk.Revit.DB.BuiltInFailures.FabricFailures.WrongFabricSheetStartOverhang
Wrong Start Overhang of the Fabric Sheet Type.

Autodesk.Revit.DB.BuiltInFailures.FabricFailures.WrongFabricSheetSpacing
Wrong Spacing of the Fabric Sheet Type.

Autodesk.Revit.DB.BuiltInFailures.FabricFailures.WrongFabricSheetOverallLength
Wrong Overall Length/Width of the Fabric Sheet Type.

Autodesk.Revit.DB.BuiltInFailures.FabricFailures.WrongFabricSheetNumberOfWires
Wrong Number of Wires of the Fabric Sheet Type.

Autodesk.Revit.DB.BuiltInFailures.FabricFailures.WrongFabricSheetLayoutPattern
The Layout Pattern cannot accommodate the current data. Try decreasing the Number of Wires/Spacing.

Autodesk.Revit.DB.BuiltInFailures.FabricFailures.WrongFabricSheetEndOverhang
Wrong Start Overhang of the Fabric Sheet Type.

Autodesk.Revit.DB.BuiltInFailures.FabricFailures.WireDiameterTooLarge
Fabric Wire Diameter is too large.

Autodesk.Revit.DB.BuiltInFailures.FabricFailures.NoWireMaterialDensity
Material does not have a density defined. The weight of the Fabric Sheet cannot be computed.

Autodesk.Revit.DB.BuiltInFailures.FabricFailures.NoSurfPatternOnWire
Wire elements do not support surface patterns. The surface pattern associated with this material will not be displayed on the indicated Fabric Sheet Type.

Autodesk.Revit.DB.BuiltInFailures.FabricFailures.MinorSpacingFailure
The spacing in the minor direction is lower than diameter of the wire in the major direction.

Autodesk.Revit.DB.BuiltInFailures.FabricFailures.MinorOverhangFailure
At least one of the overhangs in the minor direction is lower than radius of the wire in the major direction.

Autodesk.Revit.DB.BuiltInFailures.FabricFailures.MinorLapSpliceFailure
The lap splice in the minor direction is greater than the half of the overall width.

Autodesk.Revit.DB.BuiltInFailures.FabricFailures.MajorSpacingFailure
The spacing in the major direction is lower than diameter of the wire in the minor direction.

Autodesk.Revit.DB.BuiltInFailures.FabricFailures.MajorOverhangFailure
At least one of the overhangs in the major direction is lower than radius of the wire in the minor direction.

Autodesk.Revit.DB.BuiltInFailures.FabricFailures.MajorLapSpliceFailure
The lap splice in the major direction is greater than the half of the overall length.

Autodesk.Revit.DB.BuiltInFailures.FabricFailures.FabricSheetWrongHost
Fabric Sheet can be placed only in Structural Floors and straight Structural Walls.

Autodesk.Revit.DB.BuiltInFailures.FabricFailures.FabricAreaWrongSheetAlignment
Fabric Area Sheet Alignment is incorrect. Can't create Fabric Area.

Autodesk.Revit.DB.BuiltInFailures.FabricFailures.FabricAreaWrongLapSplice
Fabric Area Sheet lap splice is incorrect. Can't create Fabric Area.

Autodesk.Revit.DB.BuiltInFailures.FabricFailures.FabricAreaWrongHost
Fabric Area can be placed only in Structural Floors and straight Structural Walls.

Autodesk.Revit.DB.BuiltInFailures.FabricFailures.CoverOffsetTooLongTemp
Cover offset is greater than host thickness - support for transient Single Fabric Sheet in editor.

Autodesk.Revit.DB.BuiltInFailures.FabricFailures.CoverOffsetTooLong
Cover offset is greater than host thickness.

Autodesk.Revit.DB.BuiltInFailures.FabricFailures.CannotPlaceFabricSheetWarn
Can't find a host for Fabric Sheet.

Autodesk.Revit.DB.BuiltInFailures.FabricFailures.CannotPlaceFabricSheet
Can't find a host for Fabric Sheet.

Autodesk.Revit.DB.BuiltInFailures.FabricFailures.CannotPlaceFabricAreaWarn
Can't find a host for Fabric Area.

Autodesk.Revit.DB.BuiltInFailures.FabricFailures.CannotPlaceFabricArea
Can't find a host for Fabric Area.

Autodesk.Revit.DB.BuiltInFailures.FabricFailures.BentHiddenWires
The wires of this custom fabric sheet type are longer than the bending sketch. The linear quantities shown in schedules and tags are not accurate.

Autodesk.Revit.DB.BuiltInFailures.FabricFailures.BendPolylineInvalid
The bend profile contains too short of a segment to apply the wire bend diameter. Cannot create a bent fabric sheet for this type.

Autodesk.Revit.DB.BuiltInFailures.FabricFailures.BendDiameterNegative
Fabric Bend Diameter is negative.

Autodesk.Revit.DB.BuiltInFailures.FabricFailures
Failures about Fabric.